Repository: AbrahmAB/turtleextras
Catalog: po/*.po
Languages: ne

source: turtleart-extras (master)
ne: टर्टलआर्ट-अन्य (master)

source: Turtle Blocks
ne: टर्टल खण्ड

source: Turtle Art
ne: टर्टल आर्ट

source: Turtle Art Mini
ne: टर्टल आर्ट मिनि

source: Turtle Confusion
ne: टर्टल स्तब्घ

source: Select a challenge
ne: एउटा मुकाब्ला छान

source: Amazonas Tortuga
ne: एमाजोनस टोर्टुगा

source: Turtle Flags
ne: टर्टल झण्डाहरु

source: Use the turtle to draw country flags
ne: देशका झण्डाहरुका चित्र बनाउन कछुवाको प्रयोग गर

source: Palette of Mexican pesos
ne: मेक्सिकन पेसोको प्यालेट

source: Palette of Colombian pesos
ne: कोल्म्बियन पेसोको प्यालेट

source: Palette of Rwandan francs
ne: रूआण्डान फ्रेकंको प्यालेट

source: Palette of US dollars
ne: अमेरिकी डलरको प्यालेट

source: Palette of Australian dollars
ne: अस्ट्रेलियन डलरको प्यालेट

source: Palette of Paraguayan Guaranies
ne: प्याराग्वेली ग्यारैनहरुको प्यालेट

source: Palette of Uruguayan Pesos
ne: उरुगुएन पेसोको प्यालेट

source: TurtleBots
ne: टर्टलबोट्स

source: ERROR: The speed must be a value between 0 and 1023
ne: त्रुटि: गति ० र १०२३ को विचमा हुनु पर्दछ।

source: ERROR: The speed must be a value between -1023 and 1023
ne: त्रुटि: गति -१०२३ र १०२३ को विचमा हुनु पर्दछ।

source: ERROR: The pin must be between 1 and 8
ne: त्रुटि: पिन १ र ८ को विचमा हुनु पर्दछ।

source: button
ne: बटन

source: gray
ne: खरानी रङ

source: light
ne: उज्यालो

source: distance
ne: दुरी

source: resistance
ne: प्रतिबन्ध

source: voltage
ne: भोल्टेज

source: temperature
ne: तापमान

source: Butia Robot
ne: बुटिया रोबट

source: battery charge Butia
ne: बुटियाको बैटरी चार्ज

source: speed Butia
ne: बुटियाको गति बढाऊ

source: set the speed of the Butia motors
ne: बुटिया मोटरको गति सेट गर

source: move Butia
ne: बुटिया चलाउ

source: left
ne: बायाँ

source: right
ne: दायाँ

source: moves the Butia motors at the specified speed
ne: बुटिया मोटरलाई निश्चित गतिमा चलाउ

source: stop Butia
ne: बुटियालाई रोक

source: stop the Butia robot
ne: बुटिया रोबटलाई रोक

source: forward Butia
ne: बुटियालाई अगाडि लग

source: move the Butia robot forward
ne: बुटिया रोबटलाई अगाडि सार

source: left Butia
ne: बायाँ बुटिया

source: turn the Butia robot at left
ne: बुटिया रोबटलाई वायाँ मोड़

source: right Butia
ne: दायाँ बुटिया

source: turn the Butia robot at right
ne: बुटिया रोबटलाई दायाँ मोड़

source: backward Butia
ne: बुटियालाई पछाडि सार

source: move the Butia robot backward
ne: बुटिया रोबटलाई पछाडि सार

source: Butia Robot extra blocks
ne: बुटिया रोबोट अतिरिक्त ब्लकहरू

source: pin
ne: पिन

source: value
ne: मान

source: Set HIGH value for digital pin.
ne: डिजिटल पिनको लागि HIGH मान सेट गर।

source: Set LOW value for digital port.
ne: डिजिटल पोर्टको लागि LOW मान सेट गर।

source: Butia
ne: बुटिया

source: new name
ne: नयाँ नाम

source: original
ne: मौलिक

source: name
ne: नाम

source: Cast a new block
ne: नयाँ ब्लक cast गर

source: Butia IP
ne: बुटिया IP

source: change the IP of butia robot
ne: बुटिया रोबोटको IP परिवर्तन गर

source: ERROR: The pin %s must be in OUTPUT mode.
ne: त्रुटि: %s पिन आउटपुट मोडमा हुनु पर्दछ

source: ERROR: The pin %s must be in INPUT mode.
ne: त्रुटि: %s पिन इनपुट मोडमा हुनु पर्दछ

source: ERROR: Something wrong with function '%s'
ne: त्रुटि: फङ्कसन %s मा केहि मिलेको छैन

source: ERROR: Invalid IP '%s'
ne: त्रुटि: अमान्य IP '%s'

source: Creating PyBot server
ne: PyBot सर्भर बनाउँदै

source: ERROR creating PyBot server
ne: PyBot सर्भर बनाउँदै गर्दा त्रुटि

source: PyBot is alive!
ne: PyBot सुचारु छ !

source: Error on initialization of the camera
ne: क्यामरा सुरु गर्दा त्रुटि

source: No camera was found
ne: कुनै क्यामरा फेला परेन

source: Error stopping camera
ne: क्यामरा रोक्दा त्रुटि

source: Error starting camera
ne: क्यामरा सुरु गर्दा त्रुटि

source: Search for a connected camera.
ne: जडान भएको क्यामरा खोज

source: calibration
ne: व्यासमापन

source: store a personalized calibration
ne: व्यक्तिगत व्यासमापन स्टोर गर

source: return a personalized calibration
ne: व्यक्तिगत व्यासमापन फिर्ता गर

source: follow
ne: अनुगमन

source: follow a color or calibration
ne: रंग वा व्यासमापन अनुकरण गर

source: brightness
ne: चम्किलोपन

source: set the camera brightness as a value between 0 to 255.
ne: क्यामराको ब्राइटनेसको मान ० देखि २५५ को बिचमा सेट गर

source: minimum pixels
ne: न्युनत्तम पिक्सेल

source: set the minimal number of pixels to follow
ne: परिणाम हेर्न न्यूनतम संख्या सेट गर

source: threshold
ne: सीमा

source: set a threshold for a RGB color
ne: RGB रंगको लागि सीमा रेखा सेट गर

source: camera mode
ne: क्यामरा मोड

source: set the color mode of the camera: RGB; YUV or HSV
ne: क्यामराको कलर मोड सेट गर: RGB; YUV or HSV

source: average color
ne: औसत रङ

source: x position
ne: x स्थान

source: return x position
ne: x स्थान फिर्ता गर

source: y position
ne: y स्थान

source: return y position
ne: y स्थान फिर्ता गर

source: pixels
ne: पिक्सेलहरु

source: return the number of pixels of the biggest blob
ne: सबैभन्दा ठुलो बल्बको पिक्सेलहरुको सङ्ख्या फर्काउँछ

source: get color
ne: रङ लिने

source: get the color of an object
ne: कुनै वस्तुका लागि रङ लिने

source: color distance
ne: रङ दुरी

source: empty calibration
ne: खाली व्यासमापन

source: error in string conversion
ne: स्ट्रिंग सम्परिवर्तनमा त्रुटि छ

source: Pattern detection
ne: प्याटर्न पहिचान

source: submit the speed to the SumBot
ne: सम्बोट्लाई गति देऊ

source: set the default speed for the movement commands
ne: चाल आदेशहरुको लागि पूर्वनिर्धारित गति सेट गर।

source: forward SumBot
ne: सम्बोट्लाई अगाडि लग

source: move SumBot forward
ne: सम्बोट्लाई अगाडि सार

source: backward SumBot
ne: सम्बोट्लाई पछाडि लग

source: move SumBot backward
ne: सम्बोट्लाई पछाडि सार

source: stop SumBot
ne: सम्बोट्लाई रोक

source: stop the SumBot
ne: सम्बोट्लाई रोक

source: left SumBot
ne: सम्बोट्लाई बायाँ मोड़

source: turn left the SumBot
ne: सम्बोट्लाई बायाँ मोड़

source: right SumBot
ne: सम्बोट्लाई दायाँ मोड़

source: turn right the SumBot
ne: सम्बोट्लाई दायाँ मोड़

source: angle to center
ne: केंद्र तर्फ कोण गर

source: get the angle to the center of the dohyo
ne: डोजोको केंद्र तर्फ कोण मिलाऊ

source: angle to Enemy
ne: शत्रु तर्फ कोण राख

source: get the angle to the Enemy
ne: शत्रु तर्फ कोण मिलाऊ

source: x coor. SumBot
ne: सम्बोट्को x निर्देशांक

source: get the x coordinate of the SumBot
ne: सम्बोट्को x निर्देशांक लिऊ ।

source: y coor. SumBot
ne: सम्बोट्को y निर्देशांक

source: get the y coordinate of the SumBot
ne: सम्बोट्को य निर्देशांक लिऊ ।

source: x coor. Enemy
ne: सम्बोट्को शत्रुको x निर्देशांक

source: get the x coordinate of the Enemy
ne: शत्रुको x निर्देशांक लिऊ ।

source: y coor. Enemy
ne: सम्बोट्को शत्रुको y निर्देशांक

source: get the y coordinate of the Enemy
ne: शत्रुको ञ निर्देशांक लिऊ ।

source: rotation SumBot
ne: सम्बोट्को परिक्रमण

source: get the rotation of the Sumbot
ne: सम्बोट्को परिक्रमण लिऊ ।

source: rotation Enemy
ne: शत्रुको परिक्रमण

source: get the rotation of the Enemy
ne: शत्रुको परिक्रमण लिऊ ।

source: distance to center
ne: केंद्र सम्मको दुरी

source: get the distance to the center of the dohyo
ne: डोजोको केंद्र सम्मको दुरी लिऊ ।

source: distance to Enemy
ne: शत्रुसम्मको दुरी

source: get the distance to the Enemy
ne: शत्रुसम्मको दुरी लिऊ ।

source: update information
ne: सुचना अद्यावधिक गर

source: update information from the server
ne: सर्भरबाट सुचना अद्यावधिक गर

source: Palette of physics blocks
ne: भौतिकविज्ञान खण्डहरुको प्यालेट

source: start polygon
ne: बहुभुज सुरु गर

source: Begin defining a new polygon based on the current Turtle xy position.
ne: हालको टर्टलको xy स्थानमा आधारित नयाँ बहुभुज परिभाषा गर्न सुरु गर।

source: add point
ne: बिन्दु थप

source: Add a new point to the current polygon based on the current Turtle xy position.
ne: हालको टर्टलको xy स्थानमा आधारित हालको बहुभुजमा नयाँ बिन्दु थप ।

source: end polygon
ne: बहुभुज अन्त गर

source: Define a new polygon.
ne: नयाँ बहुभुज परिभाषा गर।

source: end filled polygon
ne: भरेको बहुभुज अन्त गर

source: Not a simple polygon
ne: सामान्य बहुभुज हैन

source: Define a new filled polygon.
ne: नयाँ भरेको बहुभुज परिभाषा गर।

source: triangle
ne: त्रिभुज

source: base
ne: सतह

source: height
ne: उचाइ

source: Add a triangle object to the project.
ne: परियोजनामा त्रिभुज वस्तु थप ।

source: circle
ne: वृत्त

source: Add a circle object to the project.
ne: परियोजनामा वृत्त वस्तु थप ।

source: rectangle
ne: समकोण आयत

source: width
ne: चौडाइ

source: Add a rectangle object to the project.
ne: परियोजनामा समकोण आयत वस्तु थप ।

source: reset
ne: पुनराम्भ

source: Reset the project; clear the object list.
ne: परियोजना पुनराम्भ गर; वस्तु सुचि सफा गर।

source: motor
ne: मोटर

source: torque
ne: चक्रिय गति

source: speed
ne: गति

source: Motor torque and speed range from 0 (off) to positive numbers; motor is placed on the most recent object created.
ne: मोटरको चक्रिय गति र गति ०(बन्द) देखि सकारात्मक अंकहरु सम्म फैलिएको हुन्छ; मोटर हालै मात्र बनाएको वस्तुमा राखिन्छ।

source: Pin an object down so that it cannot fall.
ne: वस्तुलाई नखस्ने गरि त्यसलाई अड्याऊ।

source: joint
ne: संयुक्त

source: Join two objects together (the object at the current location and the object at point x, y).
ne: दुईवटा वस्तुहरु साथमा जोड (हालैको स्थानमा रहेको वस्तु र बिन्दु x, y को वस्तु)

source: Save the project to the Journal as a Physics activity.
ne: भौतिकविज्ञान क्रियाकलापको रुपमा परियोजनालाई पंजिकामा सेभ गर।

source: density
ne: घनत्व

source: Set the density property for objects (density can be any positive number).
ne: वस्तुहरुको लागि घनत्व गुण सेट गर(घनत्व कुनै पनि सकारात्मक अंक हुन सक्छ)।

source: friction
ne: घर्षण

source: Set the friction property for objects (value from 0 to 1, where 0 turns friction off and 1 is strong friction).
ne: वस्तुहरुको लागि घर्षण गुण सेट गर( ० देखि १ सम्घम मान, जहाँ ० ले घर्षणलाई बन्द गर्छ र १ मज़बूत घर्षण हो)।

source: bounciness
ne: ठोक्किएर फर्कने गुण

source: Set the bounciness property for objects (a value from 0 to 1, where 0 means no bounce and 1 is very bouncy).
ne: वस्तुहरुको लागि ठोक्किएर फर्कने गुण सेट गर( ० देखि १ सम्घम मान, जहाँ ० भन्नाले शून्य उछाल र १ घेरै उत्फुल्ल हो)।

source: dynamic
ne: गतिशील शक्ति

source: If dynamic = 1, the object can move; if dynamic = 0, it is fixed in position.
ne: यदि गतिशील शक्ति ‍ = १, वस्तु चल्न सक्छ; यदि गतिशील शक्ति ‍ = ०, त्यो स्थानमा स्थापित हुन्छ।

source: Palette of WeDo blocks
ne: WeDo खण्डहरुको प्यालेट

source: tilt
ne: झुकाव

source: tilt sensor output: (-1 == no tilt, 0 == tilt forward, 3 == tilt back, 1 == tilt left, 2 == tilt right)
ne: सेन्सरको आउट्पुट झुकाऊ:(-१==नझुकाऊ,०==अगाडि झुकाऊ,३==पछाडि झुकाऊ,१==बायाँ झुकाऊ,२‍‍‍‍==दायाँ झुकाऊ)

source: distance sensor output
ne: सेन्सरको आउट्पुटको दुरी

source: Motor A
ne: मोटर A

source: returns the current value of Motor A
ne: मोटर Aको हालको मान फर्काउँछ

source: Motor B
ne: मोटर B

source: returns the current value of Motor B
ne: मोटर Bको हालको मान फर्काउँछ

source: set the value for Motor A
ne: मोटर Aको मान सेट गर

source: set the value for Motor B
ne: मोटर Bको मान सेट गर

source: Palette of LEGO NXT blocks of motors
ne: मोटरहरुको LEGO NXT खण्डहरुको प्यालेट

source: Palette of LEGO NXT blocks of sensors
ne: सेन्सरहरुको LEGO NXT खण्डहरुको प्यालेट

source: color
ne: रंग

source: sound
ne: ध्बनि

source: An error has occurred: check all connections and try to reconnect
ne: एउटा त्रुटि भएको छ: सबै जडानहरू जाँच र पुन जडान गर्ने प्रयास गर

source: NXT not found
ne: NXT भटिएन

source: refresh NXT
ne: NXTलाई ताजा पार

source: Search for a connected NXT brick.
ne: जडान भएको NXT ब्रिकलाई खोज।

source: set current NXT device
ne: हालैको NXT उपकरण सेट गर

source: frequency
ne: आवृत्ति

source: time
ne: समय

source: Play a tone at frequency for time.
ne: समयको लागि आवृतिमा आवाज सुरु गर।

source: port
ne: पोर्ट

source: rotations
ne: आवर्तनहरु

source: power
ne: शक्ति

source: turn a motor
ne: मोटरलाई घूमाऊ

source: PORT %s
ne: पोर्ट %s

source: start motor
ne: मोटर सुरु गर

source: Run a motor forever.
ne: मोटरलाई सधैको लागि चलाऊ।

source: brake motor
ne: मोटरलाई ब्रेक लगाऊ

source: Stop a specified motor.
ne: उल्लेखित मोटर बन्द गर।

source: reset motor
ne: मोटरलाई रिसेट गर

source: Reset the motor counter.
ne: मोटर काउन्टर रिसेट गर

source: motor position
ne: मोटरको स्थान

source: Get the motor position.
ne: मोटरको स्थान प्राप्त गर।

source: read
ne: पढ

source: sensor
ne: संवेदक

source: Read sensor output.
ne: संवेदकको उपज पढ।

source: light sensor
ne: प्रकाश संवेदक

source: distance sensor
ne: दुरी संवेदक

source: sound sensor
ne: ध्वनिको सेन्सर

source: color sensor
ne: रंगको संवेदक

source: set light
ne: प्रकाश सेट गर

source: Set color sensor light.
ne: अनुरुप पढ

source: battery level
ne: ब्याट्रि लेभल

source: ERROR: Check the Arduino and the number of port.
ne: ERROR: अर्दिनो र पोर्टको सङ्ख्या जाच।

source: ERROR: Value must be a number from 0 to 1.
ne: त्रुटि: मान ० देखि १ सम्मको अंक हुनुपर्छ।

source: ERROR: Value must be a number from 0 to 180.
ne: त्रुटि: मान ० देखि १८० सम्मको अंक हुनुपर्छ।

source: ERROR: Value must be either HIGH or LOW, 0 or 1
ne: त्रुटि: मान कि HIGH अथवा LOW, कि ० वा १ हुनुपर्छ।

source: ERROR: The value must be an integer.
ne: त्रुटि: मान एक पूर्ण सङ्ख्या हुनु पर्दछ।

source: ERROR: The pin must be an integer.
ne: त्रुटि: पिन एक पूर्ण सङ्ख्या हुनु पर्दछ।

source: ERROR: You must configure the mode for the pin.
ne: त्रुटि: तपाईँले पिनको लागि मोड कन्फिगर गर्नु पर्दछ।

source: arduino
ne: अरडुइनो

source: Search for connected Arduinos.
ne: जडान भएका अरडुइनोहरू खोज

source: Arduino
ne: अरडुइनो

source: set current Arduino board
ne: हालको अरडुइनो बोर्ड सेट गर

source: number of Arduinos
ne: अरडुइनोहरूको सङ्ख्या

source: number of Arduino boards
ne: अरडुइनो बोर्डहरूको सङ्ख्या

source: Arduino name
ne: अरडुइनो नाम

source: pin mode
ne: पिन विधि

source: Select the pin function (INPUT, OUTPUT, PWM, SERVO).
ne: पिन कार्य(INPUT, OUTPUT, PWM, SERVO) छान।

source: analog write
ne: अनुरुप लेख

source: Write analog value in specified port.
ne: उल्लेखित पोर्टमा अनुरुप मान लेख।

source: analog read
ne: अनुरुप पढ

source: digital write
ne: डिजिटल लेख

source: Write digital value to specified port.
ne: उल्लेखित पोर्टमा डिजिटल मान लेख।

source: digital read
ne: डिजिटल पढ

source: Read value from digital port.
ne: डिजिटल पोर्टबाट मान पढ।

source: Set HIGH value for digital port.
ne: डिजिटल पोर्टको लागि HIGH मान सेट गर।

source: Configure Arduino port for digital input.
ne: डिजिटल आगतको लागि Arduino समनुरूप गर

source: Configure Arduino port to drive a servo.
ne: सर्वो चलाउन Arduino समनुरूप गर।

source: Configure Arduino port for digital output.
ne: डिजिटल उत्पादको लागि Arduino समनुरूप गर

source: Configure Arduino port for PWM (pulse-width modulation).
ne: PWM(pulse-width modulation)को लागि समनुरूप गर।

source: Not found Arduino %s
ne: Arduino %s फेला परेन

source: The pin must be an integer
ne: पिन एक पूर्ण सङ्ख्या हुनु पर्दछ।

source: The device must be an integer
ne: यो उपकरण एक पूर्ण सङ्ख्या हुनु पर्दछ।

source: Error loading %s board
ne: %s बोर्ड लोड गर्दा त्रुटि

source: Palette of Expeyes blocks
ne: Expeyes ब्लकहरूको प्यालेट

source: set PVS
ne: PVS सेट गर

source: set SQR1 voltage
ne: SQR1 भोल्टेज सेट गर

source: set SQR2 voltage
ne: SQR2 भोल्टेज सेट गर

source: set OD1
ne: OD1 सेट गर

source: capture
ne: क्यापचर

source: input
ne: इनपुट

source: samples
ne: नमुनाहरू

source: Expeyes device not found
ne: Expeyes उपकरण फेला परेन
