Repository: AbrahmAB/turtleextras
Catalog: po/pap.po
Languages: pap

source: Turtle Blocks
pap: Blòki di Turtuga

source: Turtle Art
pap: ArteTurtuga

source: Turtle Art Mini
pap: Arte di Turtuga Mini

source: Turtle Confusion
pap: Konfushon di Turtuga

source: Select a challenge
pap: Selektá un desafio

source: Amazonas Tortuga
pap: Turtuga di Amazonas

source: Turtle Flags
pap: Bandera di Turtuga

source: Use the turtle to draw country flags
pap: Uza e turtuga pa pinta bandera di pais

source: Palette of Mexican pesos
pap: Palèt di peso meksikano

source: Palette of Colombian pesos
pap: Palèt di peso kolombiano

source: Palette of Rwandan francs
pap: Palèt di franko rwandes

source: Palette of US dollars
pap: Palèt di dòlar merikano

source: Palette of Australian dollars
pap: Palèt di dòlar oustraliano

source: Palette of Paraguayan Guaranies
pap: Patèt di warani paraguayo

source: Palette of Peruvian Nuevo Soles
pap: Palèt di Nuevo Soles peruano

source: Palette of Uruguayan Pesos
pap: Palèt di peso uruguayo

source: TurtleBlocks with Butia, Lego NxT, WeDo, Arduino, FollowMe plugins
pap: TurtleBlocks ku Butia. Lego Nxt, WeDo, Arduino, FollowMe plugins

source: ERROR: The speed must be a value between 0 and 1023
pap: EROR: balor di e velosidat mester ta entre 0 i 1023

source: ERROR: The speed must be a value between -1023 and 1023
pap: EROR: Balor di e velosidat mester ta entre - 1023 i 1023

source: ERROR: The pin must be between 1 and 8
pap: EROR: E pen mester ta entre 1 i 8

source: ERROR: The value must be 0 or 1, LOW or HIGH
pap: EROR: E balor mester ta 0 òf 1, ABOU ÒF HALTU

source: ERROR: The mode must be INPUT or OUTPUT.
pap: EROR: E modo mester ta INPUT òf OUTPUT.

source: turns LED on and off: 1 means on, 0 means off
pap: ta sende i paga LED: 1 ta nifiká sendé, 0 ta nifiká pagá.

source: returns the gray level as a value between 0 and 65535
pap: ta debolbé e nivel shinishi komo un balor entre 0 i 65535

source: returns 1 when the button is pressed and 0 otherwise
pap: ta debolbé 1 ora primi e boton i 0 den otro kaso

source: returns the light level as a value between 0 and 65535
pap: ta debolbé e nivel di lus komo un balor entre 0 i 65535

source: returns the distance as a value between 0 and 65535
pap: ta debolbé e distansia komo un balor entre 0 i 65535

source: returns the resistance value (ohms)
pap: ta debolbé e balor di resistensia (ohm)

source: returns the voltage value (volts)
pap: ta debolbé e balor di voltahe (vòlt)

source: returns the temperature value (celsius degree)
pap: ta debolbé e balor di temperatura (grado celsius)

source: custom module %s
pap: módulo personalisá %s

source: actuator a
pap: aktivadó a

source: actuator b
pap: aktivadó b

source: actuator c
pap: aktivadó c

source: button
pap: boton

source: gray
pap: shinishi

source: light
pap: lus

source: distance
pap: distansia

source: resistance
pap: resistensia

source: voltage
pap: vòltahe

source: temperature
pap: temperatura

source: Butia Robot
pap: Robòt Butia

source: refresh Butia
pap: aktualisá Butia

source: refresh the state of the Butia palette and blocks
pap: aktualisá estado di palèt i blòkinan di Butia

source: battery charge Butia
pap: karga di bateria di Butia

source: returns the battery charge in volts. If no motors present, it returns 255
pap: ta debolbé karga di bateria den vòlt. Si no tin motor, e ta bira 255

source: speed Butia
pap: velosidat di Butia

source: set the speed of the Butia motors
pap: fiha velosidat di e motornan di Butia

source: left
pap: na man robes

source: right
pap: na man drechi

source: moves the Butia motors at the specified speed
pap: ta move e motornan di Butia na e velosidat spesífika

source: stop Butia
pap: stòp Butia

source: stop the Butia robot
pap: stòp robòt Butia

source: forward Butia
pap: manda Butia dilanti

source: move the Butia robot forward
pap: move robòt Butia dilanti

source: left Butia
pap: bira Butia na man robes

source: turn the Butia robot at left
pap: bira robòt Butia na man robes

source: right Butia
pap: bira Butia na man drechi

source: turn the Butia robot at right
pap: bira robòt Butia na man drechi

source: backward Butia
pap: manda Butia patras

source: move the Butia robot backward
pap: manda robòt Butia patras

source: butia-extra
pap: butia-ekstra

source: Butia Robot extra blocks
pap: blòki èkstra di Robòt Butia

source: pin mode Butia
pap: modo di pen Butia

source: pin
pap: pen

source: mode
pap: modo

source: Select the pin function (INPUT, OUTPUT).
pap: selektá funshon di e pin (INPUT, OUTPUT).

source: read pin Butia
pap: lesa pin Butia

source: read the value of a pin
pap: lesa balor di un pin

source: write pin Butia
pap: skirbi pin di Butia

source: value
pap: balor

source: set a hack pin to 0 or 1
pap: fiha un hack pin na 0 òf 1

source: Configure hack pin for digital input.
pap: Konfigurá hack pen pa input digital.

source: HIGH
pap: HALTU

source: Set HIGH value for digital pin.
pap: Fiha balor HALTU pa pen digital

source: LOW
pap: ABOU

source: Set LOW value for digital port.
pap: Pone balor ABOU pa portal digital.

source: Configure hack port for digital output.
pap: Konfigurá un porta hack pa output digital.

source: butia-cast
pap: cast-butia

source: Butia Robot cast blocks
pap: blòki di cast di Robòt Butia

source: new name
pap: nòmber nobo

source: name
pap: nòmber

source: Cast a new block
pap: Cast un blòki nobo

source: generic module %s
pap: Mòdulo genériko %s

source: Butia IP
pap: IP Butia

source: change the IP of butia robot
pap: kambia IP di robòt butia

source: ERROR: The pin %s must be in OUTPUT mode.
pap: EROR: E pin %s mester ta den OUTPUT mode.

source: ERROR: The pin %s must be in INPUT mode.
pap: EROR: E pin %s mester ta den INPUT mode

source: ERROR: Something wrong with function '%s'
pap: EROR: Tin algu robes ku funshon ´%s´

source: ERROR: cannot init GCONF client: %s
pap: EROR: no por inis GCONF di kliente: %s

source: ERROR: You must cast Sensor or Actuator: A, B or C
pap: ERROR: Mester cast Sensor òf Aktuadó: A,B òf C

source: ERROR: Invalid IP '%s'
pap: ERROR: IP '%s inbálido

source: Creating PyBot server
pap: Kreando server PyBot

source: ERROR creating PyBot server
pap: ERROR: kreando server PyBot

source: PyBot is alive!
pap: PyBot ta bibu!

source: Ending butia polling
pap: Kabando enkuesta di butia

source: Error importing Pygame. This plugin require Pygame 1.9
pap: Eror ku importashon di Pygame. E plugin akí ta rekerí Pygame 1.9

source: Error on initialization of the camera
pap: Eror ku inisialisashon di e kámara

source: No camera was found
pap: No a haña kámara

source: Error stopping camera
pap: Eror ora stòp kámara

source: Error starting camera
pap: Eror ora start kámara

source: Error in get mask
pap: Eror ku get mask

source: followme
pap: sigui mi

source: FollowMe
pap: SiguiMi

source: refresh FollowMe
pap: aktualisá SiguiMi

source: Search for a connected camera.
pap: Buska un kámara konektá

source: calibration
pap: kalibrashon

source: store a personalized calibration
pap: warda un kalibrashon personalisá

source: return a personalized calibration
pap: debolbé un kalibrashon personalisá

source: follow
pap: sigui

source: follow a color or calibration
pap: sigui un koló òf kalibrashon

source: brightness
pap: klaridat

source: set the camera brightness as a value between 0 to 255.
pap: pone klaridat di e kámara na un balor entre 0 pa 255.

source: minimum pixels
pap: peksel/punto mínimo

source: set the minimal number of pixels to follow
pap: pone e kantidat mínimo de peksel pa sigui

source: threshold
pap: umbral

source: set a threshold for a RGB color
pap: pone un umbral pa koló RGB

source: camera mode
pap: modo di kámara

source: set the color mode of the camera: RGB; YUV or HSV
pap: pone e modo di koló di e kámara: RGB; YUV o HSV

source: get brightness
pap: optené klaridat

source: get the brightness of the ambient light
pap: optené e klaridat di e lus di ambiente

source: average color
pap: koló averahe

source: if set to 0 then color averaging is off during calibration;for other values, it is on
pap: si ta poné na 0 e koló averahe ta pagá durante kalibrashon; pa otro balor e ta sendé

source: x position
pap: posishon x

source: return x position
pap: bai bèk na posishon x

source: y position
pap: posishon y

source: return y position
pap: bai bèk na posishon y

source: pixels
pap: peksel

source: return the number of pixels of the biggest blob
pap: debolbé e kantidat di peksel di e blob mas grandi

source: set the color mode of the camera to RGB
pap: pone e modo di koló di e kámara pa RGB

source: set the color mode of the camera to YUV
pap: pone e modo di koló di e kámara pa YUV

source: set the color mode of the camera to HSV
pap: pone e modo di koló di e kámara pa HSV

source: get color
pap: optené kóló

source: get the color of an object
pap: optené koló di un opheto

source: color distance
pap: distansia di koló

source: set the distance to identify a color
pap: fiha distansia pa identifiká un koló

source: empty calibration
pap: hasi kalibrashon bashí

source: error in string conversion
pap: eror den konvershon di e kadena

source: Pattern detection
pap: detekshon di patronchi

source: pattern_detection
pap: detekshon_patronchi

source: Seeing signal
pap: Mirando señal

source: Returns True if the signal is in front of the camera
pap: Ta bira Berdat si e señal ta dilanti di e kámara

source: Distance to signal
pap: Distansia te na e señal

source: Returns the distance of the signal to the camera in millimeters
pap: Ta hasi e distansia di e señal pa e kámara den milimeter

source: speed SumBot
pap: hisa spit di SumBot

source: submit the speed to the SumBot
pap: presentá e spit pa e SumBot

source: set the default speed for the movement commands
pap: pone e spit predeterminá pa e komandonan di movishon

source: forward SumBot
pap: manda SumBot dilanti

source: move SumBot forward
pap: move SumBot padilanti

source: backward SumBot
pap: manda SumBot patras

source: move SumBot backward
pap: move SumBot bai patras

source: stop SumBot
pap: stòp SumBot

source: stop the SumBot
pap: stòp SumBot

source: left SumBot
pap: SumBot na man robes

source: turn left the SumBot
pap: bira SumBot na man robes

source: right SumBot
pap: move SumBot na man drechi

source: turn right the SumBot
pap: bira Sumbot na man drechi

source: angle to center
pap: ángulo pa sentra

source: get the angle to the center of the dohyo
pap: tuma e ángulo pa sentra e dohyo

source: angle to Enemy
pap: ángulo pa Enemy

source: get the angle to the Enemy
pap: tuma e ángulo pa Enemy

source: x coor. SumBot
pap: x coordinadó SumBot

source: get the x coordinate of the SumBot
pap: tuma e koordinadó x di e SumBot

source: y coor. SumBot
pap: koordinadó y SumBot

source: get the y coordinate of the SumBot
pap: tuma e koordinadó y di SumBot

source: x coor. Enemy
pap: koordinadó x Enemy

source: get the x coordinate of the Enemy
pap: tuma e koordinadó x di Enemy

source: y coor. Enemy
pap: koordinadó y Enemy

source: get the y coordinate of the Enemy
pap: tuma e koordinadó y di Enemy

source: rotation SumBot
pap: rotashon SumBot

source: get the rotation of the Sumbot
pap: tuma e rotashon di e SumBot

source: rotation Enemy
pap: rotashon Enemy

source: get the rotation of the Enemy
pap: tuma e rotashon di Enemy

source: distance to center
pap: distansia pa sentra

source: get the distance to the center of the dohyo
pap: tuma e distansia pa sentra e dohyo

source: distance to Enemy
pap: distansia pa Enemy

source: get the distance to the Enemy
pap: tuma e distansia te na Enemy

source: update information
pap: aktualisá informashon

source: update information from the server
pap: aktualisá informashon di e server

source: Palette of physics blocks
pap: Palèt di blòkinan físiko

source: start polygon
pap: inisiá polygon

source: Begin defining a new polygon based on the current Turtle xy position.
pap: Kuminsá definí un polygon nobo basá riba Turtle aktual di posishon xy

source: add point
pap: añadí punto

source: Add a new point to the current polygon based on the current Turtle xy position.
pap: Añadí un punto nobo na e polígono aktual basá riba e posishon xy aktual di Turtuga.

source: end polygon
pap: terminá polígono

source: Define a new polygon.
pap: Definí un polígono nobo.

source: end filled polygon
pap: terminá polígono yená

source: Not a simple polygon
pap: No ta un polígono simpel

source: Define a new filled polygon.
pap: Definí un polígono yená nobo.

source: triangle
pap: triángulo

source: height
pap: haltura

source: Add a triangle object to the project.
pap: Añadí un opheto triangulo na e proyekto.

source: circle
pap: sírkulo

source: Add a circle object to the project.
pap: Añadí un opheto sírkulo na e proyekto.

source: rectangle
pap: rektángulo

source: width
pap: hanchura

source: Add a rectangle object to the project.
pap: Añadí un opheto sírkulo na e proyekto.

source: reset
pap: reinisiá

source: Reset the project; clear the object list.
pap: Reinisiá e proyekto; hasi e lista di opheto bashí.

source: speed
pap: velosidat

source: Motor torque and speed range from 0 (off) to positive numbers; motor is placed on the most recent object created.
pap: Torque i velosidat di motor ta varia di 0 (pagá) te numbernan positivo; ta pone e motor riba e opheto kreá mas resien.

source: Pin an object down so that it cannot fall.
pap: Pega un opheto di tal manera ku e no por kai.

source: pen
pap: pèn

source: Add a pen to an object so that its movements are traced.
pap: Añadí un pèn na un opheto di manera ku por sigui su moveshonnan.

source: joint
pap: skarnir

source: Join two objects together (the object at the current location and the object at point x, y).
pap: Uni dos opheto (e opheto krea mas resien i e opheto na punto x, y).

source: save as Physics activity
pap: Warda komo un aktividat di Físika.

source: Save the project to the Journal as a Physics activity.
pap: Warda e proyekto den Diario komo un aktividat di Físika.

source: gear
pap: wil ku djente

source: Add a gear object to the project.
pap: Añadí un opheto wil ku djente na e proyekto.

source: density
pap: densidat

source: Set the density property for objects (density can be any positive number).
pap: Fiha e kualidat densidat pa ophetonan (densidat por ta kualke number positivo).

source: friction
pap: frikshon

source: Set the friction property for objects (value from 0 to 1, where 0 turns friction off and 1 is strong friction).
pap: Fiha e kualidat frikshon pa ophetonan (balor di 0 te 1, unda 0 ta sin frikshon i 1 ta frikshon fuerte).

source: bounciness
pap: restitushon

source: Set the bounciness property for objects (a value from 0 to 1, where 0 means no bounce and 1 is very bouncy).
pap: Fiha e kualidat restitushon pa ophetonan (balor di 0 pa 1, unda 0 ta sin restitushon i 1 ta hopi restitushon).

source: dynamic
pap: dinámiko

source: If dynamic = 1, the object can move; if dynamic = 0, it is fixed in position.
pap: Si dinámiko = 1, e opheto por move; si dinámiko = 0, e opheto ta keda fiho den su posishon.

source: Palette of WeDo blocks
pap: Palèt di blòki WeDo

source: The parameter must be a integer, not
pap: E parameter mester ta un sifra hinté, no

source: Motor speed must be an integer between -100 and 100
pap: Spit di motor mester ta un sifra hinté entre -100 i 100

source: WeDo found %s bricks
pap: WeDo a haña %s piedra

source: WeDo not found
pap: No a haña WeDo

source: WeDo number %s was not found
pap: WeDo number %s no a ser hañá

source: refresh WeDo
pap: aktualisá WeDo

source: Search for a connected WeDo.
pap: Buska un WeDo konektá

source: set current WeDo device
pap: instalá e aktual aparato WeDo

source: number of WeDos
pap: kantidat di WeDo

source: number of WeDo devices
pap: kantidat di aparato WeDo

source: tilt
pap: inklinashon

source: tilt sensor output: (-1 == no tilt,0 == tilt forward, 3 == tilt back, 1 == tilt left, 2 == tilt right)
pap: output di sensor di inklinashon: (-1 == sin inklinashon, 0 == inklinashon pa padilanti, 3 == inklinashon pa patras, 1 == inklinashon pa banda robes, 2 == inklinashon pa banda drechi)

source: distance sensor output
pap: output di sensor pa distansia

source: returns the current speed of Motor A
pap: ta debolbé e balor aktual di Motor A

source: returns the current speed of Motor B
pap: ta debolbé e balor aktualisá di Motor B

source: set the speed for Motor A
pap: fiha velosidat di Motor A

source: set the speed for Motor B
pap: fiha velosidat di Motor B

source: Palette of LEGO NXT blocks of motors
pap: Palèt di blòki di motor di LEGO NXT

source: Palette of LEGO NXT blocks of sensors
pap: Palèt di blòki di sensor di LEGO NXT

source: color
pap: koló

source: sound
pap: zonido

source: Please check the connection with the brick
pap: Por fabor chèk e konekshon ku e blòki

source: Invalid port '%s'. Port must be: PORT A, B or C
pap: Porta '%s' ta inbálido. Porta mester ta PORTA A, B òf C

source: Invalid port '%s'. Port must be: PORT 1, 2, 3 or 4
pap: Porta '%s' ta inbálido. Porta mester ta PORTA 1, 2, 3 òf 4

source: The value of power must be between -127 to 127
pap: E balor di potensia mester ta entre -127 i 127

source: The parameter must be a integer, not '%s'
pap: E parameter mester ta un number hinté, no '%s'

source: An error has occurred: check all connections and try to reconnect
pap: A okurí un eror: chèk tur koneshon i trata na rekonektá.

source: NXT found %s bricks
pap: NXT a haña %s blòki

source: NXT not found
pap: no a haña NXT

source: Brick number %s was not found
pap: No a haña blòki number %s

source: nxt-motors
pap: motor-nxt

source: refresh NXT
pap: aktualisá NXT

source: Search for a connected NXT brick.
pap: Buska un blòki NXT konektá.

source: set current NXT device
pap: instalá e aktual aparato NXT

source: number of NXTs
pap: kantidat di NXTnan

source: number of NXT devices
pap: kantidat di aparatonan NXT

source: brick name
pap: nòmber di blòki

source: Get the name of a brick.
pap: Optené nòmber di un blòki.

source: play tone
pap: toka tono

source: frequency
pap: frekuensia

source: time
pap: tempu

source: Play a tone at frequency for time.
pap: Toka un tono na sierto frekuensia pa un tempu.

source: turn motor %s
pap: bira motor %s

source: port
pap: porta

source: rotations
pap: rotashon

source: power
pap: potensia

source: turn a motor
pap: bira un motor

source: synchronize %s motors
pap: sinkronisá motor %s

source: synchronize two motors connected in PORT B and PORT C
pap: sinkronisá dos motor konektá na PORTA B i PORTA C

source: PORT %s
pap: PORTA %s

source: PORT %s of the brick
pap: PORTA %s di e blòki

source: Run a motor forever.
pap: Laga un motor traha semper.

source: brake motor
pap: brek motor

source: Stop a specified motor.
pap: Para un motor spesífiko

source: reset motor
pap: reinisiá motor

source: Reset the motor counter.
pap: Reinisiá kontador di motor.

source: motor position
pap: posishon di motor

source: Get the motor position.
pap: Optené posishon di motor.

source: nxt-sensors
pap: sensornan-nxt

source: read
pap: lesa

source: Read sensor output.
pap: Lesa output di sensor.

source: light sensor
pap: sensor di lus

source: gray sensor
pap: sensor shinishi

source: button sensor
pap: sensor boton

source: distance sensor
pap: sensor di distansia

source: sound sensor
pap: sensor di zonido

source: color sensor
pap: sensor di koló

source: set light
pap: fiha lus

source: Set color sensor light.
pap: Fiha koló di lus di sensor.

source: battery level
pap: nivel di bateria

source: Get the battery level of the brick in millivolts
pap: Optené nivel di e bateria di e blòki den milivoltahe

source: Palette of Arduino blocks
pap: Palèt di blòki di Arduino

source: ERROR: Check the Arduino and the number of port.
pap: EROR: Chèk Arduino i number di portal.

source: ERROR: Value must be a number from 0 to 1.
pap: EROR: Balor mester ta un number di 0 te 1.

source: ERROR: Value must be a number from 0 to 180.
pap: EROR: Balor mester ta un number di 0 te 180.

source: ERROR: Value must be either HIGH or LOW, 0 or 1
pap: EROR: Balor mester ta sea HALTU òf ABOU, 0 òf 1

source: ERROR: The mode must be either INPUT, OUTPUT, PWM or SERVO.
pap: EROR: E modo mester ta sea INPUT, OUTPUT, PWM òf SERVO.

source: ERROR: The value must be an integer.
pap: EROR: E balor mester ta un number kompletu.

source: ERROR: The pin must be an integer.
pap: EROR: E pin mester ta un number kompletu.

source: ERROR: You must configure the mode for the pin.
pap: EROR: Bo mester konfigurá e modo pa e pin.

source: refresh Arduino
pap: aktualisá Arduino

source: Search for connected Arduinos.
pap: Buska e Arduinonan konektá.

source: set current Arduino board
pap: fiha bòrchi aktual di Arduino

source: number of Arduinos
pap: number di e Arduinonan

source: number of Arduino boards
pap: number di e bòrchinan di Arduino

source: Arduino name
pap: nòmber di Arduino

source: Get the name of an Arduino.
pap: Optené nòmber di un Arduino.

source: pin mode
pap: modo di pin

source: Select the pin function (INPUT, OUTPUT, PWM, SERVO).
pap: Selektá funshon di pin (INPUT, OUTPUT, PWM, SERVO).

source: analog write
pap: grabashon analógico

source: Write analog value in specified port.
pap: Skirbi balor analógiko den un portal spesifiká.

source: analog read
pap: lektura analógiko

source: Read value from analog port. Value may be between 0 and 1.
pap: lesa balor for di un porta analógiko. Balor por ta entre 0 i 1.

source: digital write
pap: grabashon digital

source: Write digital value to specified port.
pap: Skirbi balor digital den portal spesifiká

source: digital read
pap: lektura digital

source: Read value from digital port.
pap: Lesa balor for di portal digital

source: Set HIGH value for digital port.
pap: Pone balor HALTU pa portal digital

source: Configure Arduino port for digital input.
pap: Konfigurá portal Arduino pa input digital.

source: Configure Arduino port to drive a servo.
pap: Konfigurá portal Arduino pa operá un servo.

source: Configure Arduino port for digital output.
pap: Konfigurá portal Arduino pa output digital.

source: Configure Arduino port for PWM (pulse-width modulation).
pap: Konfigurá portal Arduino pa PWM (pulse-width modulation).

source: Not found Arduino %s
pap: No a haña Arduino %s

source: The pin must be an integer
pap: E pin mester ta un number kompletu

source: The device must be an integer
pap: E aparato mester ta un number kompletu

source: Error loading %s board
pap: Eror kargando bòrchi %s

source: Palette for Rodi bots using Arduino
pap: Palèt pa robòt Rodi ku ta usa Arduino

source: ERROR: Check the connection to the robot.
pap: EROR: Chèk konekshon ku e robòt.

source: ERROR: The speed must be a value between 0 and %d
pap: EROR: E velosidat mester ta un balor entre 0 i %d

source: ERROR: The speed must be a value between %(min)d and %(max)d
pap: EROR: E velosidat mester ta un balor entre 0 i %(min)d and %(max)d

source: refresh Rodi
pap: aktualisá Rodi

source: refresh the state of the Rodi palette and blocks
pap: aktualisá estado di palèt i blòkinan di Rodi

source: moves the Rodi motors at the specified speed
pap: move e motornan di Rodi na e velosidat spesifiká

source: stop Rodi
pap: stòp Rodi

source: stops the Rodi robot
pap: ta stòp robòt Rodi

source: forward Rodi
pap: manda Rodi dilanti

source: moves the Rodi robot forward
pap: ta manda robòt Rodi dilanti

source: left Rodi
pap: man robes Rodi

source: turns the Rodi robot at left
pap: ta bira robòt Rodi bai na man robes

source: right Rodi
pap: man drechi Rodi

source: turns the Rodi robot at right
pap: ta bira robòt Rodi bai na man drechi

source: backward Rodi
pap: bai patras Rodi

source: moves the Rodi robot backward
pap: ta move robòt Rodi bai patras

source: distance Rodi
pap: distansia Rodi

source: returns the distance as a value between 0 and 1
pap: ta debolbé e distansia komo un balor entre 0 i 1
