Repository: AbrahmAB/turtleextras
Catalog: po/pap.po
Languages: pap

source: Rodi %s not found
pap: No a haña Rodi %s

source: Palette of Expeyes blocks
pap: Palèt di blòki di Expeyes

source: set PVS
pap: fiha PVS

source: set programmable voltage output
pap: pone output di voltahe programabel

source: set SQR1 voltage
pap: pone voltahe di SQR1

source: set square wave 1 voltage output
pap: pone output di voltahe di onda kuadrá 1

source: set SQR2 voltage
pap: pone voltahe di SQR2

source: set square wave 2 voltage output
pap: pone output di voltahe di onda kuadrá 2

source: set OD1
pap: pone OD1

source: set digital output level (OD1) low (0) or high (1)
pap: pone nivel di output digital abou (0) òf haltu (1)

source: IN1 level
pap: nivel IN1

source: returns 1 if IN1 voltage level >2.5 volts, 0 if IN1 voltage level <= 2.5 volts
pap: debolbe 1 si nivel di voltahe IN1 >2.5 vòlt, 0 si nivel di voltahe IN1 <= 2.5 vòlt

source: IN2 level
pap: nivel IN2

source: returns 1 if IN2 voltage level >2.5 volts, 0 if IN2 voltage level <= 2.5 volts
pap: ta debolbé 1 si nivel di voltahe IN2 >2.5 vòlt, 0 si nivel di voltahe IN2 <= 2.5 vòlt

source: SEN level
pap: nivel di SEN

source: returns 1 if resistive sensor (SEN) voltage level > 2.5 volts, 0 if SEN voltage level <= 2.5 volts
pap: ta debolbé 1 si nivel di voltahe di sensor resistivo (SEN) >2,5 vòlt, 0 si nivel di voltahe SEN <= 2.5 vòlt

source: capture
pap: kapturá

source: samples
pap: muestra

source: interval
pap: intervalo

source: capture multiple samples from input at interval (MS); results pushed to FIFO
pap: kapturá muestra múltiple for di input na intervalo (MS); resultado pushá pa FIFO

source: read analog input 1 voltage
pap: lesa voltahe di input analógiko 1

source: read analog input 2 voltage
pap: lesa voltahe di input analógiko 2

source: read input 1 voltage
pap: lesa voltahe di input 1

source: read input 2 voltage
pap: lesa vothahe di input 2

source: read analog sensor input voltage
pap: lesa voltahe di input di sensor analógiko

source: read square wave 1 voltage
pap: lesa voltahe di onda kuadrá 1

source: read square wave 2 voltage
pap: lesa voltahe di onda kuadrá 2

source: read programmable voltage
pap: lesa voltahe programabel

source: Expeyes device not found
pap: No a haña aparato Expeyes
