Repository: AbrahmAB/turtleextras
Catalog: po/quz.po
Languages: quz

source: Turtle Art Mini
quz: Huch'uy CharapArte

source: Turtle Confusion
quz: Muspaq CharapArte

source: Select a challenge
quz: Huk llallipayta akllay

source: Amazonas Tortuga
quz: Yunkamanta charapacha

source: Palette of Mexican pesos
quz: Pesos Mexicanos qullqimanta

source: Palette of Colombian pesos
quz: Pesos Colombianos qullqimanta

source: Palette of Rwandan francs
quz: Francos de Ruanda qullqimanta

source: Palette of US dollars
quz: Dolar qullqimanta

source: Palette of Australian dollars
quz: Austrialiamanta dolar qullqimanta

source: Palette of Paraguayan Guaranies
quz: Paraguaymanta Guaranies qullqimanta

source: Palette of Peruvian Nuevo Soles
quz: Perumanta Nuevos Soles qullqimanta

source: Palette of Uruguayan Pesos
quz: Uyuguaymanta Pesos qullqimanta

source: TurtleBots
quz: CharapaBots

source: returns 1 when the sensors detects a magnetic field, 0 otherwise
quz: huk campo magnetico nisqata musyana tariptinqa 1 yupaytam rikuchin mana chayqa 0 yupaytam rikuchin

source: button
quz: rump'u

source: gray
quz: chiqchi

source: light
quz: k'anchana

source: temperature
quz: q'uñiynin

source: distance
quz: karukaynin

source: resistance
quz: sinchikay

source: Butia Robot
quz: Robot Butiá nisqa

source: refresh Butia
quz: Butiáta kunanyachiy

source: refresh the state of the Butia palette and blocks
quz: Butiámanta bloquekunatawan ima paletakunatawanpas kunanyachiy

source: battery charge Butia
quz: Butiap bateriyanmanta

source: speed Butia
quz: Butiap utqhayninmanta

source: set the speed of the Butia motors
quz: Butiá utqhay purintanta mat'iy

source: move Butia
quz: Butiáta kuyuchiy

source: moves the Butia motors at the specified speed
quz: Butiá utqhayta purinpaq mat'iy

source: stop Butia
quz: Butiataqa sayachiy

source: stop the Butia robot
quz: robot Butiatam sayachin

source: forward Butia
quz: ñawpaqman Butia

source: move the Butia robot forward
quz: Butiataqa ñawpaqmanmi purichiy

source: left Butia
quz: qulli Butia

source: turn the Butia robot at left
quz: pañamanhina Butiataqa muyuchiy

source: right Butia
quz: paña Butia

source: turn the Butia robot at right
quz: pañamanhina Butiataqa muyuchiy

source: backward Butia
quz: qhipaman Butia

source: move the Butia robot backward
quz: Butiataqa qhipamanmi purichiy

source: pin
quz: ratachiq

source: mode
quz: imayna kaynin

source: value
quz: chani

source: HIGH
quz: ACHKHA

source: Set HIGH value for digital port.
quz: Puerto digitalpiqa ACHKHA sutichakuq chanita akllapay.

source: INPUT
quz: HAYKUNA

source: LOW
quz: PISI

source: Set LOW value for digital port.
quz: Puerto digitalpiqa PISI sutichakuq chanita akllapay.

source: OUTPUT
quz: LLUQSINA

source: Error importing Pygame. This plugin require Pygame 1.9
quz: Pygame apachimuyqa pantarun. Kay pluginqa Pygame 1.9 nisqatam munan

source: Error on initialization of the camera
quz: camara qallarichiypiqa pantarunmi.

source: No camera was found
quz: Manam Kamaraqa tarichikunchu

source: Error stopping camera
quz: Cámara utichiyqa pantarunmi

source: Error starting camera
quz: Cámara hap'ichiyqa pantarunmi

source: Error in get mask
quz: Mascara nisqa hap'iyqa pantarunmi

source: refresh FollowMe
quz: FollowMe nisqata kunanyachiy

source: Search for a connected camera.
quz: Huk brick NXT nisqata machkhay.

source: calibration
quz: mat'ichina

source: store a personalized calibration
quz: munasqa mat'ichisqata rikuchin

source: return a personalized calibration
quz: munasqa mat'ichisqata rikuchin

source: follow
quz: qhatiy

source: follow a color or calibration
quz: llimp'i kaqta churay

source: brightness
quz: llipipiynin

source: set the camera brightness as a value between 0 to 255.
quz: Cámaraq llipipiyninta 0 nisqamnta 255 nisqakama churay.

source: minimum pixels
quz: pixelkunamanta pisi kaynin

source: set the minimal number of pixels to follow
quz: hayk'a pixeles nisqakunawan llamk'anapaqmi rikuchin

source: threshold
quz: illariymanta

source: set a threshold for a RGB color
quz: imayna RGB kananpaq illariyninta churay

source: camera mode
quz: imayna Cámara kanqa

source: set the color mode of the camera: RGB; YUV or HSV
quz: camarapaq llimp'i kananta churay: RGB; YUV utaq HSV

source: get brightness
quz: illariyninta tariy

source: get the brightness of the ambient light
quz: k'itip illariyninta tariy

source: average color
quz: chawpi kaq llimp'i

source: if set to 0 then color averaging is off during calibration; for other values it is on
quz: Sichus 0 yupaypi kanqa chayqa chawpi llimp'iqa manam k'anchasqachu kachkan mat'inapaqqa

source: x position
quz: X kinkay

source: return x position
quz: X kinrayman kutiy

source: y position
quz: Y kinray

source: return y position
quz: Y kinrayman kutiy

source: pixels
quz: pixelkuna

source: return the number of pixels of the biggest blob
quz: hatun kaqpa hayk'a pixelniyuq kasqantam rikuchin

source: set the color mode of the camera to RGB
quz: camarap llimp'i RGB nisqaman churay

source: set the color mode of the camera to YUV
quz: camarap llimp'i YUV nisqaman churay

source: set the color mode of the camera to HSV
quz: camarap llimp'i HSV nisqaman churay

source: empty calibration
quz: ch'usaq mat'ichina

source: error in string conversion
quz: qillqasqa t'ikrakuchkaptinmi pantarun

source: speed SumBot
quz: SumBotpa utqhaynin

source: submit the speed to the SumBot
quz: SumBotpa utqhayninta kamachiy

source: set the default speed for the movement commands
quz: kikinmanta kuyurinanpaq kamachiyta churay

source: forward SumBot
quz: ñawpaqman SumBot

source: move SumBot forward
quz: ñawpaqman SumBot sutichakuqtaqa purichiy

source: backward SumBot
quz: qhipaman SumBot

source: move SumBot backward
quz: qhipaman SumBot sutichakuqtaqa purichiy

source: stop SumBot
quz: SumBot sutichakuqta utichiy

source: stop the SumBot
quz: SumBot sutichakuqta utichin

source: left SumBot
quz: lluqiman SumBot

source: turn left the SumBot
quz: lluqimanhina SumBot sutichakuqta muyuchiy

source: right SumBot
quz: paña SumBot

source: turn right the SumBot
quz: pañamanhina SumBot sutichakuqta muyuchiy|

source: angle to center
quz: chawpimanta k'uchuchiy

source: get the angle to the center of the dohyo
quz: dojop chawpinmanta k'uchutaqa hurquy

source: angle to Enemy
quz: Ayqap k'uchun

source: get the angle to the Enemy
quz: Awqaqpa k'uchunta tariy

source: x coor. SumBot
quz: SumBot sutichakuqpa x coor.

source: get the x coordinate of the SumBot
quz: oponentep Y coordenandanta tarin

source: y coor. SumBot
quz: SumBot sutichakuqpa y coor.

source: get the y coordinate of the SumBot
quz: oponentep Y coordenandanta tarin

source: x coor. Enemy
quz: Awqaqpa x coor.

source: get the x coordinate of the Enemy
quz: oponentep Y coordenandanta tarin

source: y coor. Enemy
quz: Awqaqpa y coor.

source: get the y coordinate of the Enemy
quz: oponentep Y coordenandanta tarin

source: rotation SumBot
quz: SumBot sutichakuqpa muyunan

source: get the rotation of the Sumbot
quz: SumBot muyunanta tariy

source: rotation Enemy
quz: Awqaqpa muyunan

source: get the rotation of the Enemy
quz: Awqa muyunanta tariy

source: distance to center
quz: chawpikama chayanapaq

source: get the distance to the center of the dohyo
quz: dojop chawpinmanta k'uchutaqa hurquy

source: distance to Enemy
quz: Awqakama chayanapaq

source: get the distance to the Enemy
quz: Awqakama chayanapaqmi tarin

source: update information
quz: willanata kunanyachiy

source: update information from the server
quz: servidormanta willanata kunanyachiy

source: Palette of physics blocks
quz: física nisqamanta bloquekuna

source: start polygon
quz: poligonota qallariy

source: Begin defining a new polygon based on the current Turtle xy position.
quz: Kunan kaq xy nisqapi charapa tarikusqanmantam musuq poligonotaqa yurichiy.

source: add point
quz: Puntuta yapay

source: Add a new point to the current polygon based on the current Turtle xy position.
quz: Kunan kaq xy nisqapi charapa tarikusqanmantam musuq puntuta poligonoman churay.

source: end polygon
quz: poligonota tukuy

source: Define a new polygon.
quz: Musuq poligonota ruway.

source: end filled polygon
quz: unt'achisqa poligonota tukuy

source: Not a simple polygon
quz: Manam yanqa poligono nisqachu

source: Define a new filled polygon.
quz: Musuq hunt'achisqa poligonota ruway.

source: triangle
quz: Kimsak'uchu

source: base
quz: t'iqsi

source: height
quz: sayaynin

source: Add a triangle object to the project.
quz: kimsak'uchuta churay.

source: circle
quz: muyu

source: Add a circle object to the project.
quz: muyuta churay.

source: rectangle
quz: suyt'u

source: width
quz: kinraynin

source: Add a rectangle object to the project.
quz: suyt'uta churay.

source: reset
quz: pichay

source: Reset the project; clear the object list.
quz: Wakichinata pichay; llapan sinrichasqakunata pichay.

source: motor
quz: motor nisqa

source: torque
quz: q'iwinan

source: speed
quz: Utqhanan

source: Motor torque and speed range from 0 (off) to positive numbers; motor is placed on the most recent object created.
quz: Motor purinanpaq q'iwichiq utqhayachiq imaqqa, 0 yupamanta (mañusqa kaspa) positivos yupanakunaman rin; motorqa chayraq ruwachasqapim churakun.

source: Pin an object down so that it cannot fall.
quz: imaynapas ama urmayananpaqmi ratachin.

source: joint
quz: Huñukuy

source: Join two objects together (the most recent object created and the object at point x, y).
quz: Iskay imaymanakunatam tinkuchin ( chayraq imayman ruwasqatawan X, Y kasqakunawan ima).

source: save as Physics activity
quz: Física ruwanatahina waqaychay

source: Save the project to the Journal as a Physics activity.
quz: Física ruwanatahina P'anqapi waqaychay.

source: gear
quz: muyu

source: Add a gear object to the project.
quz: Wakichinam t'akyakuq imaymanata churay.

source: density
quz: densidad nisqa

source: Set the density property for objects (density can be any positive number).
quz: Imaymankunap densidad nisqantam churan (densidadqa yupana positivo nisqam kanman).

source: friction
quz: qhaquna

source: Set the friction property for objects (value from 0 to 1, where 0 turns friction off and 1 is strong friction).
quz: Imaymanakunap qhaqunakuntam churan (chaniqa 0 utaq 1 kanman, 0 yupayqa qhaqunatam rikuchin 1 yupaytaq kallpasapa kaqta).

source: bounciness
quz: kikin kaqllaman kutichiq

source: Set the bounciness property for objects (a value from 0 to 1, where 0 means no bounce and 1 is very bouncy).
quz: Imaymanakunata kikin kaqllamanmi kutichin (chaniqa 0 utaq 1 kanman, 0 yupayqa kikin kaqllaman kutichisqanta rikuchin 1 yupaytaq sinchi kaqta).

source: dynamic
quz: ch'iti

source: If dynamic = 1, the object can move; if dynamic = 0, it is fixed in position.
quz: Sichus ch'iti= 1 yupayniyuq kanqa chayqa, imaymanaqa puriyqachanqam; sichus ch'iti = 0 yupayniyuq kanqa chayqa imaymana kaqqa kikin kasqallapim kanqa.

source: Palette of WeDo blocks
quz: WeDo bloquekunamanta

source: set current WeDo device
quz: WeDo kunan kaqtam kunanyachiy

source: number of WeDo devices
quz: WeDo nisqap hayk'a dispositivos nisqakuna kasqan

source: tilt
quz: k'iraynin

source: tilt sensor output: (-1 == no tilt, 0 == tilt forward, 3 == tilt back, 1 == tilt left, 2 == tilt right)
quz: kinrayasqamanta musyasqan: (-1 == manam kinrayasqachu kachkan, 0 == ñawpaqma kinrayasqa kachkan, 3 == qhipaman kinrayasqa kachkan, 1 == lluqiman kinrayasqa kachkan, 2 == pañaman kinrayasqa kachkan)

source: distance sensor output
quz: karu kaymanta musyasqan

source: Motor A
quz: Motor A nisqa

source: returns the current value of Motor A
quz: Motor A nisqapa kunan kaq chanintam kutichin

source: Motor B
quz: Motor B nisqa

source: returns the current value of Motor B
quz: Motor B nisqapa kunan kaq chanintam kutichin

source: set the value for Motor A
quz: Motor A nisqapa chaninta akllapan

source: set the value for Motor B
quz: Motor B nisqapa chaninta akllapan

source: WeDo is unavailable
quz: WeDo manam kachkanchu

source: WeDo %d is unavailable; defaulting to 1
quz: Wedo %d nisqaqa manam kachkanchu; 1 kikin kasqallantam hap'ikuchkan

source: %(device)s is unavailable on WeDo %(wedo_number)d
quz: %(device)s kayqa manam kay %(wedo_number)d WeDo nisqapiqa kachkanchu

source: Palette of LEGO NXT blocks of motors
quz: LEGO NXT bloques motores nisqakunamanta

source: Palette of LEGO NXT blocks of sensors
quz: LEGO NXT bloques llakllana nisqakunamanta

source: touch
quz: llamina

source: ultrasonic
quz: ultrasónico uyarina

source: color
quz: llimp'i

source: sound
quz: uyarina

source: Please check the connection with the brick
quz: Amahina kaychu, tikaman t'inkichiyta qhawariy.

source: Invalid port '%s'. Port must be: PORT A, B or C
quz: Kay '%s' puerto nisqata manam allinchu kachkan. Puertoqa kanmanpuni: PUERTO A, B utaq C

source: Invalid port '%s'. Port must be: PORT 1, 2, 3 or 4
quz: Kay '%s' puerto nisqata manam allinchu kachkan. Puertoqa kanmanpuni: PUERTO 1, 2, 3 utaq 4

source: The value of power must be between -127 to 127
quz: Potencia nisqapa chaninqa 127 yupanmanta 127 yupaykama kanman.

source: The parameter must be a integer, not '%s'
quz: Yupay kaqqa hunt'am kanman mana '%s' phatmasqachu

source: An error has occurred: check all connections and try to reconnect
quz: Pantaymi rikurin: llapan t'inkichiyta qhawariy chaymantataq wakmanta t'inkichiy.

source: NXT found %s bricks
quz: NXT nisqaqa kayniraq %s tikakunatam tarirqun

source: NXT not found
quz: NXT mana tarisqa

source: Brick number %s was not found
quz: Kay yupayuq %s tikaqa manam tarichikunchu

source: refresh NXT
quz: NXT nisqata kunanyachiy

source: Search for a connected NXT brick.
quz: Huk brick NXT nisqata machkhay.

source: set current NXT device
quz: kunan kaq NXT nisqata churay

source: number of NXT devices
quz: NXT nisqap hayk'a dispositivos nisqakuna kasqan

source: brick name
quz: Tikap sutin

source: Get the name of a brick.
quz: Tikap sutinta tarin.

source: play tone
quz: uyarinap kunkanta uyarichiy

source: frequency
quz: frecuencia nisqa

source: time
quz: pacha

source: Play a tone at frequency for time.
quz: Uyarinap kunkanta frecuenciatawan unayaynintawan churaspa uyarichiy.

source: turn motor
quz: motorta muyuchiyturn motor

source: port
quz: puerto nisqa

source: power
quz: Potencia nisqa

source: rotations
quz: muyuna

source: turn a motor
quz: huk motorta muyuchiy

source: synchronize motors
quz: motorkunata mat'iy

source: steering
quz: mayma rina

source: synchronize two motors connected in PORT B and PORT C
quz: PUERTO B hinallataq PUERTO C nisqaman iskay motorkuna masichakuqta kuskanchay

source: PORT A
quz: PUERTO A nisqa

source: PORT A of the brick
quz: brick nisqapa PUERTO A nisqan

source: PORT B
quz: PUERTO B nisqa

source: PORT B of the brick
quz: brick nisqapa PUERTO B nisqan

source: PORT C
quz: PUERTO C nisqa

source: PORT C of the brick
quz: brick nisqapa PUERTO C nisqan

source: start motor
quz: motorta qallarichiy

source: Run a motor forever.
quz: Huk motorta wiñaypaq muyuchiy.

source: brake motor
quz: motorta utichiy

source: Stop a specified motor.
quz: akllasqa motorta utichiy.

source: reset motor
quz: motorta hukmanta qallarichiy

source: Reset the motor counter.
quz: Motorpa yupananta hukmanta qallarichiy.

source: motor position
quz: motorpa maypi kasqaynin

source: Get the motor position.
quz: Motorpa maypi kasqanta taripay.

source: PORT 1
quz: PUERTO 1 nisqa

source: PORT 1 of the brick
quz: brick nisqapa PUERTO 1 nisqan

source: read
quz: Ñawichay

source: sensor
quz: musyana

source: Read sensor output.
quz: Musyaymanta ñawirin.

source: PORT 2
quz: PUERTO 2 nisqa

source: PORT 2 of the brick
quz: brick nisqapa PUERTO 2 nisqan

source: light sensor
quz: k'anchariypa musyaynin

source: gray sensor
quz: chiqchikunamnta musyana

source: PORT 3
quz: PUERTO 3 nisqa

source: PORT 3 of the brick
quz: brick nisqapa PUERTO 3 nisqan

source: touch sensor
quz: ruk'anapa musyaynin

source: distance sensor
quz: karu kaymanta musyaynin

source: PORT 4
quz: PUERTO 4 nisqa

source: PORT 4 of the brick
quz: brick nisqapa PUERTO 4 nisqan

source: sound sensor
quz: uyarinapa musyaynin

source: color sensor
quz: llimp'ip musyaynin

source: set light
quz: k'ancharichiy

source: Set color sensor light.
quz: Llimp'ip musyayninpa k'anchariyninta hap'ichiy.

source: battery level
quz: baterip imayna kasqan

source: ERROR: Check the Arduino and the number of port.
quz: PANTAY: Arduino nisqatawan puerto yupanantawan qhawariy.

source: ERROR: Value must be a number from 0 to 255.
quz: PANTAY: chaniqa 0 yupaymanta 255 yupanakamanmi kanman.

source: ERROR: The mode must be either INPUT, OUTPUT, PWM or SERVO.
quz: PANTAY: imayna kayqa HAYKUNA, LLUQSINA, PWM utaq SERVO nispam kanman.

source: refresh Arduino
quz: Arduinota kunanyachiy

source: Search for connected Arduinos.
quz: Sapanka Arduinokuna tinkuchisqa kasqapi machkhan.

source: set current Arduino board
quz: kunan kaq placa Aduinotam churan

source: number of Arduinos
quz: hayk'a Arduinokuna

source: number of Arduino boards
quz: hayk'a placa Arduinokuna

source: Arduino name
quz: Arduinop sutin

source: Get the name of an Arduino.
quz: Arduinop sutinta tarin.

source: pin mode
quz: pin nisqa imayna kaynin

source: Select the pin function (INPUT, OUTPUT, PWM, SERVO).
quz: Pin nisqapa purinanta akllay (HAYKUNA, LLUQSINA, PWM, SERVO).

source: analog write
quz: analogico nisqata qillqay

source: Write analog value in specified port.
quz: alogico chanitam akllasqa puertopiqa qillqay.

source: analog read
quz: analogico nisqata nawichay

source: Read value from analog port. Value may be between 0 and 1023. Use Vref to determine voltage. For USB, volt=((read)*5)/1024) approximately.
quz: Huk puesto analogico nisqamanta huk chaniqa ñawichay. Chaniqa 0 yupanamanta 1023 yupanakama kanman. Voltaje churanapaqtaq Vref nisqawan purichiwaq. USB nisqapaqtaq, volt=((ñawiriy)*5/1024) nisqahinata.

source: digital write
quz: digitalta qillqay

source: Write digital value to specified port.
quz: digital chanitam akllasqa puertopiqa qillqay.

source: digital read
quz: digitalta ñawichay

source: Read value from digital port.
quz: Purdo digitalmanta chanitaqa ñawichay.

source: Configure Arduino port for digital input.
quz: Digital haykunahina kananpaqmi Arduino puertotaqa kamachiy.

source: Configure Arduino port to drive a servo.
quz: Servo sutichakuqta puriyachinapaqmi Arduino puertonta kamachiy.

source: Configure Arduino port for digital output.
quz: Digital lluqsinahina kananpaqmi Arduino puertotaqa kamachiy.

source: Configure Arduino port for PWM (pulse-width modulation).
quz: PWM sutichakuqwan kananpaqmi Arduino puertonta kamachiy (sakhayninwan churachinkunqa).

source: Palette of Expeyes blocks
quz: WeDo bloquekunamanta

source: set PVS
quz: PVS nisqata churay

source: set programmable voltage output
quz: ima voltaje nisqawan programasqaña lluqsinapaq churay

source: set SQR1 voltage
quz: SQR1 voltajeta churan

source: set square wave 1 voltage output
quz: lluqsip voltajemanqa onda cuadrada nisqata churan

source: set SQR2 voltage
quz: SQR2 voltajeta churay

source: set square wave 2 voltage output
quz: lluqsip voltajemanqa onda cuadrada nisqata churay

source: set OD1
quz: OD1 nisqata churay

source: set digital output level (OD1) low (0) or high (1)
quz: digital lluqsinanta (OD1) antunninpichu (0) utaq huch'uyninpichu (1) lluqsinqa chayta churay

source: IN1 level
quz: IN1 t'aqa

source: returns 1 if IN1 voltage level >2.5 volts, 0 if IN1 voltage level <= 2.5 volts
quz: sichus IN1 nisqap voltaje nisqan 2.5 volts kanqa chayqa 1 yupaytam kutichinqa, ichaqa 2.5 volts nisqa kaptinqa 0 yupaytam kutichinqa

source: IN2 level
quz: IN2 t'aqa

source: returns 1 if IN2 voltage level >2.5 volts, 0 if IN2 voltage level <= 2.5 volts
quz: sichus IN2 nisqap voltaje nisqan 2.5 volts kanqa chayqa 1 yupaytam kutichinqa, ichaqa 2.5 volts nisqa kaptinqa 0 yupaytam kutichinqa

source: SEN level
quz: SEN t'aqa

source: returns 1 if resistive sensor (SEN) voltage level > 2.5 volts, 0 if SEN voltage level <= 2.5 volts
quz: sichus musyanap (SEN) voltaje nisqan 2.5 volts kanqa chayqa 1 yupaytam kutichinqa, ichaqa 2.5 volts nisqa kaptinqa 0 yupaytam kutichinqa

source: capture
quz: hap'iy

source: input
quz: haykuna

source: samples
quz: qhawarichikuna

source: interval
quz: t'aqap pacha

source: capture multiple samples from input at interval (MS); results pushed to FIFO
quz: t'aqasqa pachakunan puriqta (MS) hap'iy; kaykunaqa FIFO nisqapim churakunqa

source: read analog input 1 voltage
quz: 1 analógico musyanaman voltaje haykusqanta ñawichay

source: read analog input 2 voltage
quz: 2 analógico musyanaman voltaje haykusqanta ñawichay

source: read input 1 voltage
quz: 1 haykunap voltaje nisqanta ñawichan

source: read input 2 voltage
quz: 2 haykunap voltaje nisqanta ñawichan

source: read analog sensor input voltage
quz: analógico musyanaman voltaje haykusqanta ñawichay

source: read square wave 1 voltage
quz: 1 onda cuadrada nisqap voltajenta ñawichan

source: read square wave 2 voltage
quz: 2 onda cuadrada nisqap voltajenta ñawichan

source: read programmable voltage
quz: programasqa voltajeta ñawichay

source: Expeyes device not found
quz: Expeyes dispositivo sutichakuqqa manam tarikunchu
